---
kind: enumMember
id: F:Autodesk.Revit.DB.SunAndShadowType.Lighting
enum: Autodesk.Revit.DB.SunAndShadowType
source: html/0f990e60-7c79-7a25-42e5-7cfe6abe5b23.htm
---
# Autodesk.Revit.DB.SunAndShadowType.Lighting

Lighting study type (fixed sun position regardless of date and time).